const express = require('express'); //ประกาศชื่อเรียกเพื่อใช้ฟังก์ชันที่เราไปหยิบมาจาก Library
const path = require('path'); //ประกาศเรียกเครื่องมือสำหรับจัดกาเรียงลำดับที่อยู่ไฟล์ 
const app = express(); //สร้างพื้นที่บนหน้าโปรแกรมสำหรับใส่ทุกคำสั่งด้านล่างลงไป เหมือนสมองหลักแต่ว่าแค่อุ่นเครืองก่อน
const port = 3000; //พิกัดของโปรแกรมที่จะบอกกับคอมพิวเตอร์เครื่องนั้นๆที่ใช้งาน เหมือนเป็นส่วนหนึ่งของ IPเครื่อง

// ดึงข้อมูลส่วนสินค้ามาเชื่อมต่อ
const productController = require('./modules/products/product.controller');

//สร้างตัวแปลภาษา J.son
app.use(express.json()); 

// หน้าแรก: ส่งไฟล์หน้าบ้านไปแสดงผล
app.get('/', (req, res) => {
    res.sendFile(path.join(__dirname, 'index.html')); //
});

// เส้นทาง API
app.get('/api/products', productController.getAllProducts);
//
app.post('/api/products', productController.createProduct);
//
app.listen(port, () => {
    //
    console.log(`🌳 Rakrao System running at http://localhost:${port}`);
});
