const express = require('express'); //ประกาศชื่อเรียกเพื่อใช้ฟังก์ชันที่เราไปหยิบมาจาก Library
const path = require('path'); //ประกาศเรียกเครื่องมือสำหรับจัดกาเรียงลำดับที่อยู่ไฟล์ 
const app = express(); //สร้างพื้นที่บนหน้าโปรแกรมสำหรับใส่ทุกคำสั่งด้านล่างลงไป เหมือนสมองหลักแต่ว่าแค่อุ่นเครืองก่อน
const port = process.env.PORT || 3000; //พิกัดของโปรแกรมที่จะบอกกับคอมพิวเตอร์เครื่องนั้นๆที่ใช้งาน เหมือนเป็นส่วนหนึ่งของ IPเครื่อง

//สร้างตัวแปลภาษา J.son
app.use(express.json()); 

// 👉 เรียก routes สินค้า
const productRoutes = require('./routes/product.routes');
app.use('/api/products', productRoutes);

// --- 🌐 [ส่วนที่ 1: การจัดการเส้นทางหน้าเว็บ (HTML Routes)] ---
// 1. หน้าแรก (Marketplace) - คนซื้อเข้ามาดูสินค้าสวยๆ
app.get('/', (req, res) => {
    res.sendFile(path.join(__dirname, 'index.html'));
});
// 2. หน้าจัดการสินค้า (Products Management)
app.get('/products', (req, res) => {
    res.sendFile(path.join(__dirname, 'login.html'));
});
// 3. หน้าจัดการสินค้า (Vendor Dashboard) - หน้าที่มีปุ่ม เพิ่ม/ลบ/แก้ไข (ย้ายมาจาก index เดิม)
app.get('/vendor/manage', (req, res) => {
    res.sendFile(path.join(__dirname, 'src', 'vendor.html'));
});

//
app.listen(port, () => {
    //
    console.log(`
    🌳 Rakrao Marketplace System is Running!
    -----------------------------------------
    🏠 Market Front: http://localhost:${port}
    🔑 Login Page:   http://localhost:${port}/login
    ⚙️ Management:   http://localhost:${port}/vendor/manage
    -----------------------------------------
    `);
});
